Revit 2027 API
ParameterTypeId.Directcontext3dSourceId Property
 "Path"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Directcontext3dSourceId { get; }
Public Shared ReadOnly Property Directcontext3dSourceId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Directcontext3dSourceId {
	ForgeTypeId^ get ();
}
static member Directcontext3dSourceId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace